In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('../data/schoolSchema.csv')

In [2]:
df.head()

,Unnamed: 0,title,tuition,location,image,rating
0,0,Alabama A & M University,10024.0,Normal AL 35762,NaN,0
1,1,University of Alabama at Birmingham,8568.0,Birmingham AL 35294-0110,NaN,0
2,3,University of Alabama in Huntsville,11488.0,Huntsville AL 35899,NaN,0
3,4,Alabama State University,11068.0,Montgomery AL 36104-0271,NaN,0
4,5,The University of Alabama,11620.0,Tuscaloosa AL 35487-0100,NaN,0

In [3]:
bool_mask = df['location'].str.contains('NY')

In [4]:
df[bool_mask].shape

(287, 6)

In [5]:
df[bool_mask].head()

,Unnamed: 0,title,tuition,location,image,rating
379,540,Bais Binyomin Academy,10050.0,Monsey NY 10952,NaN,0
1508,2011,Vaughn College of Aeronautics and Technology,26150.0,Flushing NY 11369,NaN,0
1509,2012,Adelphi University,42475.0,Garden City NY 11530-0701,NaN,0
1510,2013,SUNY Adirondack,5784.0,Queensbury NY 12804,NaN,0
1511,2014,Bryant & Stratton College-Albany,18356.0,Albany NY 12205,NaN,0

In [6]:
desiredSchoolsDF = df[bool_mask]

In [7]:
# desiredSchoolsDF['title'].to_csv('../data/NYschools.txt', index=False)

In [72]:

currentNames = pd.read_csv('../data/NYschools.txt')
print(currentNames.shape)
removeNames = pd.read_csv('../image/seen_lines.txt')
print(removeNames.shape)
currentNames = pd.concat([currentNames,removeNames],ignore_index=True).drop_duplicates(keep=False).reset_index(drop=True)
print(currentNames.shape)
print(removeNames.shape)

(287, 1)
(1, 1)
(286, 1)
(1, 1)

In [73]:
currentNames.head()

                                          title
0                         Bais Binyomin Academy
1  Vaughn College of Aeronautics and Technology
2                            Adelphi University
3                               SUNY Adirondack
4              Bryant & Stratton College-Albany

In [74]:
currentNames[currentNames['title'] == 'Bryant & Stratton College-Syracuse']

Empty DataFrame
Columns: [title]
Index: []